// 1. Створіть дві змінні для зберігання значень двох текстових полів.
// Перевірте, чи обидві змінні не є порожніми.
// Якщо обидва поля заповнені, вивести повідомлення
// "Обидва поля заповнені", якщо ні — "Не всі поля заповнені".

const text1 = "fgjyfj";
const text2 = "jhkjg";

if (text1 && text2 !== false && text2 && text1 !== false) {
  console.log("All of the inputs are filled");
} else {
  console.log("Please, fill all of the remaining inputs");
}

// 2. Створіть дві змінні для зберігання числових значень.
// Обчисліть їх суму. Якщо сума більше 10 — виведіть
// "Сума більша за 10", якщо ні — "Сума менша або дорівнює 10".

const number1 = 12;
const number2 = 6;
const total = number1 + number2;
if (total > 10) {
  console.log("Сума більша за 10");
} else {
  console.log("Сума менша або дорівнює 10");
}

// 3. Створіть змінну для зберігання тексту.
// Перевірте, чи містить цей текст слово "JavaScript".
// Якщо містить, виведіть "Текст містить слово JavaScript",
// якщо ні — "Текст не містить слово JavaScript".

const text = "I work in JavaScript"; 
if (text.includes("JavaScript")) {
  console.log("Текст містить слово JavaScript");
} else {
  console.log("Текст не містить слово JavaScript");
}

// 4. Створіть змінну для зберігання числа.
// Перевірте, чи це число більше 10 і менше 20. Якщо так — виведіть
// "Число входить в діапазон від 10 до 20", якщо ні —
// "Число не входить в діапазон від 10 до 20".

const number = 8;
if (number > 10 || number < 20) {
  console.log("Число входить в діапазон від 10 до 20");
} else {
  console.log("Число не входить в діапазон від 10 до 20");
}

// 5. Створіть змінні для зберігання значень полів (ім'я, email, пароль).
// Перевірте, чи ім'я містить не менше 3 символів, чи email містить символ @ та крапку після нього,
// а пароль не менше 6 символів. Якщо всі умови виконані —
// виведіть "Перенаправлення на іншу сторінку", якщо ні —
// "Помилка: неправильне заповнення".

const nameL = "Liya";
const email = "liya@gmail.com";
const password = "12345678L";

if (
  nameL.length >= 3 &&
  email.includes("@") &&
  email.lastIndexOf(".") > email.indexOf("@") &&
  password.length >= 6
) {
  console.log("Перенаправлення на іншу сторінку");
} else {
  console.log("Помилка: неправильне заповнення");
}
